dotfiles/.emacs.d/config.org
#+title Emacs config
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el :mkdirp yes

My pick and mix from N A N O's config

** The start of the init.el file

#+begin_src emacs-lisp
  ;; NOTE: This file is created from config.org, edit that file,
  ;; not this one.
#+end_src

** NANO Stuff

*** Path to nano emacs modules (mandatory)

#+begin_src emacs-lisp
(add-to-list 'load-path "~/.emacs.d/nano")
(add-to-list 'load-path "~/.emacs.d/custom") ; My own downloaded plugins
#+end_src

*** Default layout (optional)

#+begin_src emacs-lisp
(require 'nano-layout)
#+end_src

*** Theme

#+begin_src emacs-lisp
(require 'nano-faces)
(require 'nano-theme)
(require 'nano-theme-dark)
#+end_src

*** Set theme to dark

#+begin_src emacs-lisp
(nano-theme-set-dark)
(call-interactively 'nano-refresh-theme)
#+end_src

*** Nano default settings (optional)

#+begin_src emacs-lisp
(require 'nano-defaults)
#+end_src

*** Nano session saving (optional)

#+begin_src emacs-lisp
(require 'nano-session)
#+end_src

*** Nano header & mode lines (optional)

#+begin_src emacs-lisp
(require 'nano-modeline)
#+end_src

*** Nano counsel configuration (optional)

#+begin_src emacs-lisp
(require 'nano-counsel)
#+end_src

*** Help (optional)
#+begin_src emacs-lisp
(require 'nano-help)
#+end_src

*** Provide Nano
#+begin_src emacs-lisp
(provide 'nano)
#+end_src

** My custom config 

#+begin_src emacs-lisp
(setq nano-font-family-monospaced "OperatorMono Nerd Font")
(setq nano-font-family-proportional "OperatorMono Nerd Font")
(setq nano-font-size 14)

(setq ivy-height 8)   ;; number of lines in e.g. file-selector
(setq mini-frame-default-height 12)

;; Which key (file in 'custom' folder)
(require 'which-key)
(which-key-mode)

;; Enable line numbers in coding mode
(add-hook 'prog-mode-hook 'display-line-numbers-mode)

;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(use-package command-log-mode)

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; Ivy for completion and fuzzy
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

; Make Ivy Fuzzy
(setq ivy-re-builders-alist
      '((t . ivy--regex-fuzzy)))


;; Counsel
(use-package counsel
  :bind (("M-x" . counsel-M-x)
         ("C-x b" . counsel-ibuffer)
         ("C-x C-f" . counsel-find-file)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history)))


;; Download Evil
(unless (package-installed-p 'evil)
    (package-install 'evil))

;;;;;; Evil stuff
;; Configure evil

; Hihglight search (this needs to be before reuqire 'evil
(setq evil-search-module 'evil-search)

(use-package evil
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))



;; Evil-org-mode
(add-to-list 'load-path "~/.emacs.d/plugins/evil-org-mode")
(require 'evil-org)
(add-hook 'org-mode-hook 'evil-org-mode)
(evil-org-set-key-theme '(navigation insert textobjects additional calendar))
(require 'evil-org-agenda)
(evil-org-agenda-set-keys)

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

;; Remove toolbar and menubar and scroll-bar
(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

;; Stop saving clipboard
(setq x-select-enable-clipboard-manager nil)


;; Magit stuff
(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))

;; Projectile
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; NOTE: Set this to the folder where you keep your Git repos!
  (when (file-directory-p "~/dev")
    (setq projectile-project-search-path '("~/dev")))
  (setq projectile-switch-project-action #'projectile-dired))
(custom-set-variables
 ;; custom-set-variables was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 '(package-selected-packages
   '(doom-modeline which-key counsel-projectile projectile magit evil-collection command-log-mode)))
(custom-set-faces
 ;; custom-set-faces was added by Custom.
 ;; If you edit it by hand, you could mess it up, so be careful.
 ;; Your init file should contain only one such instance.
 ;; If there is more than one, they won't work right.
 )
#+end_src

** Org Mode

*** Better font faces

#+begin_src emacs-lisp
(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
  (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
  (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))
#+end_src

*** Auto-tangle configuration files

Doesn't work yet :/
References:
- https://youtu.be/kkqVTDbfYp4?list=PLEoMzSkcN8oPH1au7H6B7bBJ4ZO7BXjSZ&t=788
- https://github.com/daviwil/emacs-from-scratch/blob/master/Emacs.org#auto-tangle-configuration-files

#+begin_src emacs-lisp
(defun efs/org-babel-tangle-config ()
  (when (string-equal (file-name-directory (buffer-file-name))
                      (expand-file-name user-emacs-directory))
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))
#+end_src

* NOTES

- Use eval-buffer to reload this file
- Swiper rocks! Try it with C-s
  
